export default {
  'id': 1,
  'name': '签到用户分析',
  'desc': '利用签到用户对数据进行分析',
  'filter_name': [
    '签到用户'
  ],
  'total_user': 323233,
  'filter_match_user_num': 134000,
  'feature_list': [
    {
      text: '商家',
      subtexts: [
        '商家-账号'
      ]
    },
    {
      text: '人口学信息',
      subtexts: [
        '人口学信息-年龄',
        '人口学信息-职业',
        '人口学信息-城市等级',
        '人口学信息-性别'
      ]
    },
    {
      text: '用户等级',
      subtexts: [
        '用户等级-淘宝',
        '用户等级-账号创建时间'
      ]
    },
    {
      text: '渠道',
      subtexts: [
        '渠道-使用场景',
        '渠道-领取签到'
      ]
    },
    {
      text: '用户购买',
      subtexts: [
        '用户购买-淘宝成交额',
        '用户购买-有成交',
        '用户购买-淘宝成交频次',
        '用户购买-成交类型'
      ]
    },
    {
      text: '用户访问',
      subtexts: [
        '用户访问-访问时段',
        '用户访问-下单时段'
      ]
    },
    {
      text: '人生阶段',
      subtexts: [
        '人生阶段-买车',
        '人生阶段-有孩子',
        '人生阶段-买房',
        '人生阶段-年代',
        '人生阶段-已婚'
      ]
    }
  ],
  distribution: [
    {
      title: '用户习惯分析',
      services: [{
        name: '使用场景',
        type: 'line-bar',
        service: {
          's1_data': [
            193,
            6796,
            14367,
            3336,
            44167,
            40300,
            22428,
            3016,
            6704,
            2024,
            14359,
            22327,
            13736
          ],
          'subtext': '使用场景所占比例为对应场景占整体用户的比例',
          'text': '使用场景 分布',
          'y1_max': 98914,
          'x_data': [
            '访问签到',
            '充值有奖',
            '猜你喜欢',
            '生活快囤',
            '收藏',
            '超返活动',
            '限时抢',
            '超级大牌',
            '今日榜单',
            '人气活动',
            '大额优惠券',
            '专享券活动',
            '白菜价'
          ],
          's0_data': [
            0.27187693694708964,
            9.57344903363949,
            20.238631881444753,
            4.699385811686482,
            62.217557897109366,
            56.77015833662027,
            31.594072237561278,
            4.248605398095453,
            9.443849664732069,
            2.8511861159632614,
            20.227362371104977,
            31.45179466952161,
            19.34974925339494
          ]
        }
      }
      ]
    },
    {
      title: '人口学信息',
      services: [{
        name: '城市等级',
        type: 'pie',
        service: {
          'x0_data': [
            {
              'name': '二线城市',
              'value': 29815
            },
            {
              'name': '三四线城市',
              'value': 53064
            },
            {
              'name': '一线城市',
              'value': 14663
            }
          ],
          'text': '城市等级 分布',
          'subtext': '城市等级用户数：97542  用户数覆盖占全部用户比例98.61%',
          'l_data': [
            '二线城市',
            '三四线城市',
            '一线城市'
          ]
        }
      },
        {
          name: '性别',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '女',
                'value': 61252
              },
              {
                'name': '男',
                'value': 36803
              }
            ],
            'text': '性别 分布',
            'subtext': '性别用户数：98055  用户数覆盖占全部用户比例99.13%',
            'l_data': [
              '女',
              '男'
            ]
          }
        },
        {
          name: '年龄',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '25至29岁',
                'value': 26383
              },
              {
                'name': '18岁以下',
                'value': 2177
              },
              {
                'name': '50岁以上',
                'value': 4256
              },
              {
                'name': '18至24岁',
                'value': 20873
              },
              {
                'name': '35至39岁',
                'value': 11818
              },
              {
                'name': '30至34岁',
                'value': 20575
              },
              {
                'name': '40至49岁',
                'value': 12217
              }
            ],
            'text': '年龄 分布',
            'subtext': '年龄用户数：98299  用户数覆盖占全部用户比例99.38%',
            'l_data': [
              '25至29岁',
              '18岁以下',
              '50岁以上',
              '18至24岁',
              '35至39岁',
              '30至34岁',
              '40至49岁'
            ]
          }
        },
        {
          name: '职业',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '医务人员',
                'value': 1034
              },
              {
                'name': '白领',
                'value': 28361
              },
              {
                'name': '公务员',
                'value': 2893
              },
              {
                'name': '学生',
                'value': 4981
              }
            ],
            'text': '职业 分布',
            'subtext': '职业用户数：37269  用户数覆盖占全部用户比例37.68%',
            'l_data': [
              '医务人员',
              '白领',
              '公务员',
              '学生'
            ]
          }
        }]
    },
    {
      title: '用户等级',
      services: [{
        name: '淘宝等级',
        type: 'pie',
        service: {
          'x0_data': [
            {
              'name': '淘宝等级v1_2',
              'value': 29012
            },
            {
              'name': '淘宝等级v3_4',
              'value': 38922
            },
            {
              'name': '淘宝等级v0',
              'value': 24220
            },
            {
              'name': '淘宝等级v5_6',
              'value': 5993
            }
          ],
          'text': '淘宝等级 分布',
          'subtext': '淘宝等级用户数：98147  用户数覆盖占全部用户比例99.22%',
          'l_data': [
            '淘宝等级v1_2',
            '淘宝等级v3_4',
            '淘宝等级v0',
            '淘宝等级v5_6'
          ]
        }
      },
        {
          name: '一淘会员时长',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '新用户',
                'value': 15598
              },
              {
                'name': '老用户',
                'value': 67728
              },
              {
                'name': '3到6个月用户',
                'value': 15588
              }
            ],
            'text': '一淘会员时长 分布',
            'subtext': '一淘会员时长用户数：98914  用户数覆盖占全部用户比例100.00%',
            'l_data': [
              '新用户',
              '老用户',
              '3到6个月用户'
            ]
          }
        }]
    },
    {
      title: '用户购买',
      services: [{
        name: '淘宝成交频次',
        type: 'pie',
        service: {
          'x0_data': [
            {
              'name': '淘宝成交频次中高',
              'value': 21557
            },
            {
              'name': '淘宝成交频次中等',
              'value': 11851
            },
            {
              'name': '淘宝成交频次高',
              'value': 49754
            },
            {
              'name': '淘宝成交频次低',
              'value': 6316
            },
            {
              'name': '淘宝成交频次中低',
              'value': 7504
            }
          ],
          'text': '淘宝成交频次 分布',
          'subtext': '淘宝成交频次用户数：96982  用户数覆盖占全部用户比例98.05%',
          'l_data': [
            '淘宝成交频次中高',
            '淘宝成交频次中等',
            '淘宝成交频次高',
            '淘宝成交频次低',
            '淘宝成交频次中低'
          ]
        }
      },
        {
          name: '成交类型',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '第三方超级返利',
                'value': 3
              },
              {
                'name': '超级返利',
                'value': 0
              },
              {
                'name': '一淘送',
                'value': 18756
              },
              {
                'name': '高佣',
                'value': 44352
              },
              {
                'name': '全网送',
                'value': 0
              },
              {
                'name': '普通淘客',
                'value': 0
              }
            ],
            'text': '成交类型 分布',
            'subtext': '成交类型用户数：49543  用户数覆盖占全部用户比例50.09%',
            'l_data': [
              '第三方超级返利',
              '超级返利',
              '一淘送',
              '高佣',
              '全网送',
              '普通淘客'
            ]
          }
        },
        {
          name: '淘宝成交额',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '淘宝成交额中低',
                'value': 9727
              },
              {
                'name': '淘宝成交额中高',
                'value': 24301
              },
              {
                'name': '淘宝成交额低',
                'value': 7730
              },
              {
                'name': '淘宝成交额高',
                'value': 40784
              },
              {
                'name': '淘宝成交额一般',
                'value': 15488
              }
            ],
            'text': '淘宝成交额 分布',
            'subtext': '淘宝成交额用户数：98030  用户数覆盖占全部用户比例99.11%',
            'l_data': [
              '淘宝成交额中低',
              '淘宝成交额中高',
              '淘宝成交额低',
              '淘宝成交额高',
              '淘宝成交额一般'
            ]
          }
        },
        {
          name: '用户购买_重点画像',
          type: 'line-bar',
          service: {
            's1_data': [
              76005
            ],
            'subtext': '用户购买所占比例为对应场景占整体用户的比例',
            'text': '用户购买 分布',
            'y1_max': 98914,
            'x_data': [
              '一淘有成交'
            ],
            's0_data': [
              76.83869989384824
            ]
          }
        }]
    },
    {
      title: '用户访问',
      services: [{
        name: '最常下单时段',
        type: 'pie',
        service: {
          'x0_data': [
            {
              'name': '最常下单时段6到12点',
              'value': 18740
            },
            {
              'name': '最常下单时段18到24点',
              'value': 26253
            },
            {
              'name': '最常下单时段12到18点',
              'value': 26228
            },
            {
              'name': '最常下单时段0到6点',
              'value': 4508
            }
          ],
          'text': '最常下单时段 分布',
          'subtext': '最常下单时段用户数：75729  用户数覆盖占全部用户比例76.56%',
          'l_data': [
            '最常下单时段6到12点',
            '最常下单时段18到24点',
            '最常下单时段12到18点',
            '最常下单时段0到6点'
          ]
        }
      },
        {
          name: '最常访问时段',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '最常访问时段18到24点',
                'value': 35831
              },
              {
                'name': '最常访问时段0到6点',
                'value': 7033
              },
              {
                'name': '最常访问时段12到18点',
                'value': 30480
              },
              {
                'name': '最常访问时段6到12点',
                'value': 25511
              }
            ],
            'text': '最常访问时段 分布',
            'subtext': '最常访问时段用户数：98855  用户数覆盖占全部用户比例99.94%',
            'l_data': [
              '最常访问时段18到24点',
              '最常访问时段0到6点',
              '最常访问时段12到18点',
              '最常访问时段6到12点'
            ]
          }
        }]
    },
    {
      title: '人生阶段',
      services: [{
        name: '人生阶段_重点画像',
        type: 'line-bar',
        service: {
          's1_data': [
            55891,
            57667,
            63923,
            65991
          ],
          'subtext': '人生阶段所占比例为对应场景占整体用户的比例',
          'text': '人生阶段 分布',
          'y1_max': 98914,
          'x_data': [
            '有孩子',
            '买车',
            '已婚',
            '买房'
          ],
          's0_data': [
            56.50406915028054,
            58.29955011878886,
            64.62417226911995,
            66.7148561896578
          ]
        }
      },
        {
          name: '年代',
          type: 'pie',
          service: {
            'x0_data': [
              {
                'name': '00后',
                'value': 13050
              },
              {
                'name': '90后',
                'value': 48585
              },
              {
                'name': '80后',
                'value': 80442
              },
              {
                'name': '50_60_70后',
                'value': 22786
              }
            ],
            'text': '年代 分布',
            'subtext': '年代用户数：97963  用户数覆盖占全部用户比例99.04%',
            'l_data': [
              '00后',
              '90后',
              '80后',
              '50_60_70后'
            ]
          }
        }
      ]
    }
    ]
}
